In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Customers.csv')

In [3]:
df.head()

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes

In [4]:
df.isnull().sum()

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [6]:
fill=df.age.mean()

In [7]:
fill

28.65

In [8]:
df.age=df.age.fillna(fill)

In [9]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    1
buys        0
dtype: int64

In [11]:
df.m_status.mode()

0    single
dtype: object

In [13]:
df.m_status=df.m_status.fillna('single')

In [14]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [15]:
df

      age  income  gender m_status buys
0   25.00    high    male   single   no
1   25.00    high    male  married   no
2   35.00    high    male   single  yes
3   35.00  medium    male   single  yes
4   30.00     low  female   single  yes
5   32.00     low  female   single   no
6   22.00     low  female   single  yes
7   28.65  medium    male  married   no
8   25.00     low  female   single  yes
9   35.00  medium  female  married  yes
10  25.00  medium  female   single  yes
11  35.00  medium    male  married  yes
12  22.00    high  female   single  yes
13  35.00  medium    male  married   no
14  28.65    high    male   single   no
15  25.00    high  female  married  yes
16  35.00  medium    male  married  yes
17  22.00    high  female   single  yes
18  25.00  medium  female  married  yes
19  30.00    high    male   single  yes
20  30.00  medium  female  married   no
21  25.00     low    male   single  yes

In [22]:
dum_gen=pd.get_dummies(df.gender,drop_first=True)

In [24]:
df=df.drop('gender',axis=1)

In [26]:
df=pd.concat([df,dum_gen],axis=1)

In [28]:
dum_mstat=pd.get_dummies(df.m_status,drop_first=True)

In [30]:
df=df.drop('m_status',axis=1)

In [31]:
df=pd.concat([df,dum_mstat],axis=1)

In [33]:
df.head()

    age  income buys  male  single
0  25.0    high   no     1       1
1  25.0    high   no     1       0
2  35.0    high  yes     1       1
3  35.0  medium  yes     1       1
4  30.0     low  yes     0       1

In [34]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [41]:
income=['low', 'medium', 'high']

In [42]:
from sklearn.preprocessing import OrdinalEncoder

In [43]:
ordi=OrdinalEncoder(categories=[income])

In [44]:
encoded=ordi.fit_transform(df[['income']])

In [45]:
encoded

array([[2.],
       [2.],
       [2.],
       [1.],
       [0.],
       [0.],
       [0.],
       [1.],
       [0.],
       [1.],
       [1.],
       [1.],
       [2.],
       [1.],
       [2.],
       [2.],
       [1.],
       [2.],
       [1.],
       [2.],
       [1.],
       [0.]])

In [46]:
new_income=pd.DataFrame(encoded,columns=['income'])

In [47]:
new_income.head()

   income
0     2.0
1     2.0
2     2.0
3     1.0
4     0.0

In [48]:
df.income=new_income

In [51]:
df.head()

    age  income buys  male  single
0  25.0     2.0   no     1       1
1  25.0     2.0   no     1       0
2  35.0     2.0  yes     1       1
3  35.0     1.0  yes     1       1
4  30.0     0.0  yes     0       1

In [52]:
df.buys.unique()

array(['no', 'yes'], dtype=object)

In [53]:
df.buys=df.buys.replace(['no', 'yes'],[0,1])

In [55]:
df.head()

    age  income  buys  male  single
0  25.0     2.0     0     1       1
1  25.0     2.0     0     1       0
2  35.0     2.0     1     1       1
3  35.0     1.0     1     1       1
4  30.0     0.0     1     0       1

In [56]:
x=df.drop('buys',axis=1)

In [62]:
y=df.drop(['age','income','male','single'],axis=1)

In [64]:
x.head()

    age  income  male  single
0  25.0     2.0     1       1
1  25.0     2.0     1       0
2  35.0     2.0     1       1
3  35.0     1.0     1       1
4  30.0     0.0     0       1

In [65]:
y.head()

   buys
0     0
1     0
2     1
3     1
4     1